// Задача 1. (branch Task_1)
// В переменной string есть секретное сообщение, во второй есть пароль.
// Пользователю программы даётся 3 попытки ввести пароль и увидеть секретное сообщение.

// Задача 2. (branch Task_2)
// Есть программа с бесконечным циклом.
// Когда пользователь вводит exit программа заканчивается

// Задача 4. (branch Task_3)
// Продолжаем прокачивать приложение с командами. Добавить к программе, которая заканчивается, когда пишем exit еще 4 команды (их можно придумать самому).
// Например:
// SetName – Установить имя
// Help – вывести список команд
// SetPassword – Установить пароль
// Exit – выход
// WriteName – вывести имя после ввода пароля
